src/app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"
---
    def index
        # shows all listings
        @listing = Listing.all

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_listing
        id = params[:id]
        @listing = Listing.find(id)